samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
/**
 * @file active_object_test.cpp
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief Active Object design pattern test 
 * 
 * @version 0.1
 * @date 2024-03-21
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

#include "active_object_test.h" 
#include "includes_drivers.h" 
#include "stm32f4xx_it.h" 

// FreeRTOS 
#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os2.h"
#include "queue.h" 
#include "semphr.h" 
#include "timers.h" 

//=======================================================================================


//=======================================================================================
// Macros 

// Conditional compilation 
#define AO_CPP_TEST 1 
#define AO_C_TEST 0 

// Memory 
#define MIN_STACK_MULTIPLE 8 
#define THREAD_LOW_STACK_SIZE configMINIMAL_STACK_SIZE * MIN_STACK_MULTIPLE 
#define THREAD_HIGH_STACK_SIZE configMINIMAL_STACK_SIZE * MIN_STACK_MULTIPLE 

// Data 
#define SERIAL_INPUT_MAX_LEN 30 

// Timing 
#define LED_SLOW_BLINK_PERIOD 500   // (ticks) 
#define LED_FAST_BLINK_PERIOD 100   // (ticks) 

//=======================================================================================

#if AO_CPP_TEST 

//=======================================================================================
// C++ System 

class SystemData 
{
private:   // Private members 

    //==================================================
    // Low Priority Thread 

    // Low Priority Thread States 
    enum class ThreadLowStates {
        SERIAL_OUT_STATE, 
        SERIAL_IN_STATE, 
        NUM_STATES 
    } thread_low_state; 

    // Low Priority Thread Events 
    enum class ThreadLowEvents : uint8_t {
        NO_EVENT, 
        SERIAL_OUT_EVENT, 
        SERIAL_IN_EVENT 
    } thread_low_event; 

    // System info 
    ThreadEventData thread_low_event_data; 
    const uint8_t thread_low_queue_len = 3; 

    // Flags 
    struct ThreadLowFlags 
    {
        // System flags 
        uint8_t state_entry : 1; 

        // State flags 
        uint8_t serial_out  : 1; 
        uint8_t serial_in   : 1; 
    } 
    thread_low_flags; 

    //==================================================

    //==================================================
    // High Priority Thread 

    // High Priority Thread States 
    enum class ThreadHighStates {
        LED_SLOW_STATE, 
        LED_FAST_STATE, 
        NUM_STATES 
    } thread_high_state; 

    // High Priority Thread Events 
    enum class ThreadHighEvents : uint8_t {
        NO_EVENT, 
        LED_TOGGLE_EVENT 
    } thread_high_event; 

    // System info 
    ThreadEventData thread_high_event_data; 
    const uint8_t thread_high_queue_len = 3; 

    // Flags 
    struct ThreadHighFlags
    {
        // System flags 
        uint8_t state_entry  : 1; 
        uint8_t state_change : 1; 

        // State flags 
        uint8_t led_slow     : 1; 
        uint8_t led_fast     : 1; 
    } 
    thread_high_flags; 

    //==================================================

    //==================================================
    // Software Timer Thread 

    // Software timers 
    TimerHandle_t slow_blink_timer; 
    TimerHandle_t fast_blink_timer; 

    //==================================================

    //==================================================
    // General 

    // LED pin data 
    GPIO_TypeDef *led_gpio; 
    gpio_pin_num_t led_pin; 
    gpio_pin_state_t led_state; 

    // Serial terminal data 
    uint8_t uart_dma_buff[SERIAL_INPUT_MAX_LEN];   // Circular buffer 
    uint8_t buff_index;                            // Circular buffer index 
    uint8_t user_in_buff[SERIAL_INPUT_MAX_LEN];    // Stores latest user input 

    //==================================================

private:   // Private member functions 

    //==================================================
    // General 

    // State function pointer 
    typedef void (*state_func_ptr)(SystemData *data, Event event); 

    //==================================================
    
    //==================================================
    // Low Priority Thread 

    // Event loop dispatch function 
    static void DispatchThreadLow(Event event); 

    // State functions 
    static void ThreadLowState0(SystemData *data, Event event); 
    static void ThreadLowState1(SystemData *data, Event event); 

    // State table 
    const state_func_ptr thread_low_state_table[(uint8_t)ThreadLowStates::NUM_STATES] = 
    {
        &ThreadLowState0, 
        &ThreadLowState1 
    }; 

    //==================================================

    //==================================================
    // High Priority Thread 

    // Event loop dispatch function 
    static void DispatchThreadHigh(Event event); 

    // State functions 
    static void ThreadHighState0(SystemData *data, Event event); 
    static void ThreadHighState1(SystemData *data, Event event); 

    // State table 
    const state_func_ptr thread_high_state_table[(uint8_t)ThreadHighStates::NUM_STATES] = 
    {
        &ThreadHighState0, 
        &ThreadHighState1 
    }; 

    // Helper functions 
    void ThreadHighStateTrigger(void); 

    //==================================================

    //==================================================
    // Software Timer Thread 

    // Called when LED toggle timers expire 
    static void LEDTimerCallback(TimerHandle_t xTimer); 

    //==================================================

public:   // Public member functions 

    // Constructor(s) 
    SystemData() {} 

    // Destructor(s) 
    ~SystemData() {} 

    // Setup 
    void SystemDataInit(void); 

    //==================================================
    // Low Priority Thread 

    // Helper functions 
    void SerialInterrupt(void); 

    //==================================================
}; 

// System object 
static SystemData system_data; 

//=======================================================================================

