samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // Configure and enable the DMA stream 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)uart_dma_buff, 
        (uint16_t)SERIAL_INPUT_MAX_LEN); 
    dma_stream_enable(DMA1_Stream5); 

    // Initialize interrupt handler flags and enable the interrupt handler 
    int_handler_init(); 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_15); 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_low_event_data = 
    {
        .attr = { .name = "ThreadLow", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_LOW_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityLow, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = CLEAR, 
        .ThreadEventQueue = xQueueCreate(thread_low_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadLow 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_low_event_data, 
        &thread_low_event_data.attr); 
    // Check that the thread creation worked 

    uart_sendstring(USART2, "\r\n>>> "); 

    //==================================================

    //==================================================
    // High Priority Thread 

    // Initialize general data 
    thread_high_state = ThreadHighStates::LED_SLOW_STATE; 
    led_gpio = GPIOA; 
    led_pin = GPIOX_PIN_5; 
    led_state = GPIO_LOW; 
    thread_high_flags.state_entry = SET_BIT; 
    thread_high_flags.state_change = CLEAR_BIT; 
    thread_high_flags.led_slow = SET_BIT; 
    thread_high_flags.led_fast = CLEAR_BIT; 

    // Initialize board LED (on when logic low) 
    gpio_pin_init(GPIOA, PIN_5, MODER_GPO, OTYPER_PP, OSPEEDR_HIGH, PUPDR_NO); 

    // Thread definition, queue handle creation and dispatch function assignment 
    thread_high_event_data = 
    {
        .attr = { .name = "ThreadHigh", 
                  .attr_bits = CLEAR, 
                  .cb_mem = NULL, 
                  .cb_size = CLEAR, 
                  .stack_mem = NULL, 
                  .stack_size = THREAD_HIGH_STACK_SIZE, 
                  .priority = (osPriority_t)osPriorityHigh, 
                  .tz_module = CLEAR, 
                  .reserved = CLEAR }, 
        .event = (Event)ThreadHighEvents::NO_EVENT, 
        .ThreadEventQueue = xQueueCreate(thread_high_queue_len, sizeof(uint32_t)), 
        .dispatch = DispatchThreadHigh 
    }; 
    // Check that the queues were created successfully 

    // Create the thread(s) 
    osThreadNew(
        eventLoop, 
        (void *)&thread_high_event_data, 
        &thread_high_event_data.attr); 
    // Check that the thread creation worked 

    // Queue and empty event to start the LED blinks 
    xQueueSend(thread_high_event_data.ThreadEventQueue, 
        (void *)&thread_high_event_data.event, 0); 
    
    //==================================================

    //==================================================
    // Software Timers Thread 

    // Create timers 
    slow_blink_timer = xTimerCreate(
        "slow_blink_timer",             // Name of timer 
        LED_SLOW_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)0,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    fast_blink_timer = xTimerCreate(
        "fast_blink_timer",             // Name of timer 
        LED_FAST_BLINK_PERIOD,          // Period of timer (ticks) 
        pdTRUE,                         // Auto-relead --> pdTRUE == Repeat Timer 
        (void *)1,                      // Timer ID 
        LEDTimerCallback);              // Callback function 
    // Check that timers were created successfully 

    //==================================================
}

#elif AO_C_TEST 

void AOSystemInit(void)
{
    // Initialize GPIO ports 
    gpio_port_init(); 

    //==================================================
    // Low Priority Thread 

    // Initialize general data 
    thread_low_trackers.state = THREAD_LOW_SERIAL_OUT_STATE; 
    memset((void *)thread_low_trackers.uart_dma_buff, CLEAR, 
           sizeof(thread_low_trackers.uart_dma_buff)); 
    thread_low_trackers.buff_index = CLEAR; 
    memset((void *)thread_low_trackers.user_in_buff, CLEAR, 
           sizeof(thread_low_trackers.user_in_buff)); 
    thread_low_trackers.state_entry = SET_BIT; 
    thread_low_trackers.serial_out = SET_BIT; 
    thread_low_trackers.serial_in = CLEAR_BIT; 

    // Initialize UART 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE);   // RX DMA enabled for serial terminal reading 
    
    // Enable IDLE line interrupts for reading serial terminal input with DMA 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure and enable the DMA stream 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)thread_low_trackers.uart_dma_buff, 
        (uint16_t)SERIAL_INPUT_MAX_LEN); 
    dma_stream_enable(DMA1_Stream5); 

