samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
            // Toggle the high priority thread state 
            data->thread_high_flags.state_change = SET_BIT; 
            
            // Trigger the next state and event 
            data->thread_low_flags.serial_out = SET_BIT; 
            data->thread_low_event_data.event = (Event)ThreadLowEvents::SERIAL_OUT_EVENT; 
            xQueueSend(data->thread_low_event_data.ThreadEventQueue, 
                       (void *)&data->thread_low_event_data.event, 0); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (data->thread_low_flags.serial_out)
    {
        data->thread_low_flags.state_entry = SET_BIT; 
        data->thread_low_flags.serial_in = CLEAR_BIT; 
    }
}

// Serial Interrupt 
void SystemData::SerialInterrupt(void)
{
    BaseType_t task_woken = pdFALSE; 

    // Trigger a state change and queue a serial input event 
    thread_low_flags.serial_out = CLEAR_BIT; 
    thread_low_flags.serial_in = SET_BIT; 
    thread_low_flags.state_entry = SET_BIT; 

    thread_low_event_data.event = (Event)ThreadLowEvents::SERIAL_IN_EVENT; 
    xQueueSendFromISR(thread_low_event_data.ThreadEventQueue, 
                      (void *)&thread_low_event_data.event, &task_woken); 
}

#elif AO_C_TEST 

// In practice these dispatch functions would likely be separated into different files 
// to help organize the code. 

// Dispatch function for low priority thread 
void DispatchThreadLow(Event event)
{
    ThreadLowStates state = thread_low_trackers.state; 

    // Continuous events. These are thread events that happen irrespective of state. 

    // State machine 
    switch (state)
    {
        case THREAD_LOW_SERIAL_OUT_STATE: 
            if (thread_low_trackers.serial_in)
            {
                state = THREAD_LOW_SERIAL_IN_STATE; 
            }
            break; 
        
        case THREAD_LOW_SERIAL_IN_STATE: 
            if (thread_low_trackers.serial_out)
            {
                state = THREAD_LOW_SERIAL_OUT_STATE; 
            }
            break; 

        default: 
            state = THREAD_LOW_SERIAL_OUT_STATE; 
            break; 
    }

    // Run state function 
    thread_low_state_table[state](&thread_low_trackers, event); 
    thread_low_trackers.state = state; 
}


// In practice the state functions would likely be in the same file as the function that 
// dispatched them. Each dispatching function would likely have its own file. 

// Low Priority Thread: State 0 
void ThreadLowState0(
    ThreadLowTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_low_trackers.state_entry)
    {
        thread_low_trackers.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_LOW_SERIAL_OUT_EVENT: 
            SerialOutEvent((char *)thread_low_trackers.user_in_buff); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_low_trackers.serial_in)
    {
        thread_low_trackers.state_entry = SET_BIT; 
        thread_low_trackers.serial_out = CLEAR_BIT; 
    }
}


// Low Priority Thread: State 1 
void ThreadLowState1(
    ThreadLowTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_low_trackers.state_entry)
    {
        thread_low_trackers.state_entry = CLEAR_BIT; 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_LOW_SERIAL_IN_EVENT: 
            SerialInEvent(
                thread_low_trackers.uart_dma_buff, 
                &thread_low_trackers.buff_index, 
                thread_low_trackers.user_in_buff); 

            // Toggle the high priority thread state 
            ThreadHighStateToggle(); 
            
            // Trigger the next state and event 
            thread_low_trackers.serial_out = SET_BIT; 
            thread_low_trackers.event_data.event = THREAD_LOW_SERIAL_OUT_EVENT; 
            xQueueSend(thread_low_trackers.event_data.ThreadEventQueue, 
                       (void *)&thread_low_trackers.event_data.event, 0); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_low_trackers.serial_out)
    {
        thread_low_trackers.state_entry = SET_BIT; 
        thread_low_trackers.serial_in = CLEAR_BIT; 
    }
}

#endif 

#if INTERRUPT_OVERRIDE 

// USART2 - overridden 
void USART2_IRQHandler(void)
{
    handler_flags.usart2_flag = SET_BIT; 

#if AO_CPP_TEST 

    system_data.SerialInterrupt(); 

#elif AO_C_TEST 

    BaseType_t task_woken = pdFALSE; 

    // Trigger a state change and queue a serial input event 
    thread_low_trackers.serial_out = CLEAR_BIT; 
    thread_low_trackers.serial_in = SET_BIT; 
    thread_low_trackers.state_entry = SET_BIT; 

    thread_low_trackers.event_data.event = THREAD_LOW_SERIAL_IN_EVENT; 
    xQueueSendFromISR(thread_low_trackers.event_data.ThreadEventQueue, 
                      (void *)&thread_low_trackers.event_data.event, &task_woken); 

#endif 

    // The following is needed to exit the ISR 
    dummy_read(USART2->SR); 
    dummy_read(USART2->DR); 
}

#endif   // INTERRUPT_OVERRIDE 

//=======================================================================================


//=======================================================================================
// High Priority Thread event control 

#if AO_CPP_TEST 

// High Priority Thread: Dispatch 
void SystemData::DispatchThreadHigh(Event event)
{
    // A thread does not necessarily need a state machine. Instead, there could simply be 
    // a list of events available for when they're requested. For example, the high 
    // priority thread could be dedicated to reading data from devices irrespective of 
    // state and each read gets triggered by a timer. 

    ThreadHighStates state = system_data.thread_high_state; 

    // Continuous events. These are thread events that happen irrespective of state. 

    // State machine 
    switch (state)
    {
        case ThreadHighStates::LED_SLOW_STATE: 
            if (system_data.thread_high_flags.led_fast)
            {
                state = ThreadHighStates::LED_FAST_STATE; 
            }
            break; 

        case ThreadHighStates::LED_FAST_STATE: 
            if (system_data.thread_high_flags.led_slow)
            {
                state = ThreadHighStates::LED_SLOW_STATE; 
            }
            break; 
        
        default: 
            state = ThreadHighStates::LED_SLOW_STATE; 
            break; 
    }

