samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // Run state function 
    system_data.thread_high_state_table[(uint8_t)state](&system_data, event); 
    system_data.thread_high_state = state; 
}

// High Priority Thread: State 0 
void SystemData::ThreadHighState0(SystemData *data, Event event)
{
    // State entry 
    if (data->thread_high_flags.state_entry)
    {
        data->thread_high_flags.state_entry = CLEAR_BIT; 

        xTimerStart(data->slow_blink_timer, 0); 
    }

    data->thread_high_event = (ThreadHighEvents)event; 

    // Event selection 
    switch (data->thread_high_event)
    {
        case ThreadHighEvents::LED_TOGGLE_EVENT: 
            PinToggleEvent(
                data->led_gpio, 
                data->led_pin, 
                &data->led_state); 

            if (data->thread_high_flags.state_change)
            {
                data->thread_high_flags.state_change = CLEAR_BIT; 
                data->thread_high_flags.led_fast = SET_BIT; 

                // Trigger the next state with an empty event 
                data->ThreadHighStateTrigger(); 
            }
            break; 

        default: 
            break; 
    }

    // State exit 
    if (data->thread_high_flags.led_fast)
    {
        data->thread_high_flags.state_entry = SET_BIT; 
        data->thread_high_flags.led_slow = CLEAR_BIT; 

        xTimerStop(data->slow_blink_timer, 0); 
    }
}

// High Priority Thread: State 1 
void SystemData::ThreadHighState1(SystemData *data, Event event)
{
    // State entry 
    if (data->thread_high_flags.state_entry)
    {
        data->thread_high_flags.state_entry = CLEAR_BIT; 

        xTimerStart(data->fast_blink_timer, 0); 
    }

    data->thread_high_event = (ThreadHighEvents)event; 

    // Event selection 
    switch (data->thread_high_event)
    {
        case ThreadHighEvents::LED_TOGGLE_EVENT: 
            PinToggleEvent(
                data->led_gpio, 
                data->led_pin, 
                &data->led_state); 

            if (data->thread_high_flags.state_change)
            {
                data->thread_high_flags.state_change = CLEAR_BIT; 
                data->thread_high_flags.led_slow = SET_BIT; 

                // Trigger the next state with an empty event 
                data->ThreadHighStateTrigger(); 
            }
            break; 

        default: 
            break; 
    }

    // State exit 
    if (data->thread_high_flags.led_slow)
    {
        data->thread_high_flags.state_entry = SET_BIT; 
        data->thread_high_flags.led_fast = CLEAR_BIT; 

        xTimerStop(data->fast_blink_timer, 0); 
    }
}

// Trigger/start the next state 
void SystemData::ThreadHighStateTrigger(void)
{
    // Queue an empty event to get the thread to change states and start blinking the 
    // LED at an updated rate immediately. 
    thread_high_event_data.event = (Event)ThreadHighEvents::NO_EVENT; 
    xQueueSend(thread_high_event_data.ThreadEventQueue, 
        (void *)&thread_high_event_data.event, 0); 
}

#elif AO_C_TEST 

// In practice these dispatch functions would likely be separated into different files 
// to help organize the code. 

// Dispatch function for high priority thread 
void DispatchThreadHigh(Event event)
{
    // A thread does not necessarily need a state machine. Instead, there could simply be 
    // a list of events available for when they're requested. For example, the high 
    // priority thread could be dedicated to reading data from devices irrespective of 
    // state and each read gets triggered by a timer. 

    ThreadHighStates state = thread_high_trackers.state; 

    // Continuous events. These are thread events that happen irrespective of state. 

    // State machine 
    switch (state)
    {
        case THREAD_HIGH_LED_SLOW_STATE: 
            if (thread_high_trackers.led_fast)
            {
                state = THREAD_HIGH_LED_FAST_STATE; 
            }
            break; 

        case THREAD_HIGH_LED_FAST_STATE: 
            if (thread_high_trackers.led_slow)
            {
                state = THREAD_HIGH_LED_SLOW_STATE; 
            }
            break; 
        
        default: 
            state = THREAD_HIGH_LED_SLOW_STATE; 
            break; 
    }

    // Run state function 
    thread_high_state_table[state](&thread_high_trackers, event); 
    thread_high_trackers.state = state; 
}


// In practice the state functions would likely be in the same file as the function that 
// dispatched them. Each dispatching function would likely have its own file. 

// High Priority Thread: State 0 
void ThreadHighState0(
    ThreadHighTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_high_trackers.state_entry)
    {
        thread_high_trackers.state_entry = CLEAR_BIT; 

        xTimerStart(thread_high_trackers.slow_blink_timer, 0); 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_HIGH_LED_TOGGLE_EVENT: 
            PinToggleEvent(
                thread_high_trackers.led_gpio, 
                thread_high_trackers.led_pin, 
                &thread_high_trackers.led_state); 

            if (thread_high_trackers.state_change)
            {
                thread_high_trackers.state_change = CLEAR_BIT; 
                thread_high_trackers.led_fast = SET_BIT; 

                // Trigger the next state with an empty event 
                ThreadHighStateTrigger(); 
            }
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_high_trackers.led_fast)
    {
        thread_high_trackers.state_entry = SET_BIT; 
        thread_high_trackers.led_slow = CLEAR_BIT; 

        xTimerStop(thread_high_trackers.slow_blink_timer, 0); 
    }
}


// High Priority Thread: State 1 
void ThreadHighState1(
    ThreadHighTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_high_trackers.state_entry)
    {
        thread_high_trackers.state_entry = CLEAR_BIT; 

        xTimerStart(thread_high_trackers.fast_blink_timer, 0); 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_HIGH_LED_TOGGLE_EVENT: 
            PinToggleEvent(
                thread_high_trackers.led_gpio, 
                thread_high_trackers.led_pin, 
                &thread_high_trackers.led_state); 

            if (thread_high_trackers.state_change)
            {
                thread_high_trackers.state_change = CLEAR_BIT; 
                thread_high_trackers.led_slow = SET_BIT; 

                // Trigger the next state with an empty event 
                ThreadHighStateTrigger(); 
            }
            break; 

        default: 
            break; 
    }

